In [21]:
!dir C:\SimplonIA\donnees\brazilian_e-commerce

 Le volume dans le lecteur C s'appelle Windows
 Le num‚ro de s‚rie du volume est 1C31-FAE4

 R‚pertoire de C:\SimplonIA\donnees\brazilian_e-commerce

12/10/2020  20:50    <DIR>          .
12/10/2020  20:50    <DIR>          ..
12/10/2020  20:48           172ÿ195 olist_closed_deals_dataset.csv
06/10/2019  21:27         9ÿ033ÿ957 olist_customers_dataset.csv
06/10/2019  21:27        61ÿ273ÿ883 olist_geolocation_dataset.csv
12/10/2020  20:47           711ÿ837 olist_marketing_qualified_leads_dataset.csv
06/10/2019  21:27        17ÿ654ÿ914 olist_orders_dataset.csv
06/10/2019  21:27        15ÿ438ÿ671 olist_order_items_dataset.csv
06/10/2019  21:27         5ÿ777ÿ138 olist_order_payments_dataset.csv
06/10/2019  21:27        14ÿ409ÿ007 olist_order_reviews_dataset.csv
06/10/2019  21:27         2ÿ379ÿ446 olist_products_dataset.csv
12/10/2020  20:47           177ÿ799 olist_sellers_dataset.csv
12/10/2020  20:47             2ÿ613 product_category_name_translation.csv
              11 fichier(s)      127ÿ031ÿ460 octets
               2 R‚p(s)  426ÿ796ÿ421ÿ120 octets libres

In [22]:
import pandas

# Les dates

> Avec 'parse_dates', on convertit la colonne "date" au type datetime

### Commandes

In [59]:
import pandas as pd
dfcmd = pd.read_csv(r"C:\SimplonIA\donnees\brazilian_e-commerce\olist_orders_dataset.csv",
        parse_dates =['order_purchase_timestamp',
       'order_approved_at', 'order_delivered_carrier_date',
       'order_delivered_customer_date', 'order_estimated_delivery_date']                   
                   )
dfcmd.head(10)

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26
5,a4591c265e18cb1dcee52889e2d8acc3,503740e9ca751ccdda7ba28e9ab8f608,delivered,2017-07-09 21:57:05,2017-07-09 22:10:13,2017-07-11 14:58:04,2017-07-26 10:57:55,2017-08-01
6,136cce7faa42fdb2cefd53fdc79a6098,ed0271e0b7da060a393796590e7b737a,invoiced,2017-04-11 12:22:08,2017-04-13 13:25:17,NaT,NaT,2017-05-09
7,6514b8ad8028c9f2cc2374ded245783f,9bdf08b4b3b52b5526ff42d37d47f222,delivered,2017-05-16 13:10:30,2017-05-16 13:22:11,2017-05-22 10:07:46,2017-05-26 12:55:51,2017-06-07
8,76c6e866289321a7c93b82b54852dc33,f54a9f0e6b351c431402b8461ea51999,delivered,2017-01-23 18:29:09,2017-01-25 02:50:47,2017-01-26 14:16:31,2017-02-02 14:08:10,2017-03-06
9,e69bfb5eb88e0ed6a785585b27e16dbf,31ad1d1b63eb9962463f764d4e6e0c9d,delivered,2017-07-29 11:55:02,2017-07-29 12:05:32,2017-08-10 19:45:24,2017-08-16 17:14:30,2017-08-23

In [60]:
dfcmd.dtypes

order_id                                 object
customer_id                              object
order_status                             object
order_purchase_timestamp         datetime64[ns]
order_approved_at                datetime64[ns]
order_delivered_carrier_date     datetime64[ns]
order_delivered_customer_date    datetime64[ns]
order_estimated_delivery_date    datetime64[ns]
dtype: object

> La fonction .dt.dayofweek

In [64]:
dfcmd.order_delivered_customer_date.dt.dayofweek

0        1.0
1        1.0
2        4.0
3        5.0
4        4.0
        ...
99436    4.0
99437    2.0
99438    3.0
99439    3.0
99440    4.0
Name: order_delivered_customer_date, Length: 99441, dtype: float64

> On extrait l'année, le mois et le jour et on les isole dans une colonne

In [67]:
dfcmd['annee'] = dfcmd.order_purchase_timestamp.dt.year
dfcmd['mois'] = dfcmd.order_purchase_timestamp.dt.month
dfcmd['jours'] = dfcmd.order_purchase_timestamp.dt.dayofweek
dfcmd.head()

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date,annee,mois,jours
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18,2017,10,0
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13,2018,7,1
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04,2018,8,2
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15,2017,11,5
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26,2018,2,1

> Délais de livraison

In [69]:
dfcmd.order_delivered_customer_date - dfcmd.order_purchase_timestamp

0        8 days 10:28:40
1       13 days 18:46:08
2        9 days 09:27:40
3       13 days 05:00:36
4        2 days 20:58:23
              ...
99436    8 days 05:13:56
99437   22 days 04:38:58
99438   24 days 20:37:34
99439   17 days 02:04:27
99440    7 days 16:11:00
Length: 99441, dtype: timedelta64[ns]

### Paiements

In [57]:
import pandas as pd
dfpmt = pd.read_csv(r"C:\SimplonIA\donnees\brazilian_e-commerce\olist_order_payments_dataset.csv")
dfpmt.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [38]:
dfpmt.shape

(103886, 5)

> Somme de paiements par identifiant de commandes

In [39]:
dfpmt.groupby (['order_id']).sum()

,payment_sequential,payment_installments,payment_value
order_id,,,
00010242fe8c5a6d1ba2dd792cb16214,1,2,72.19
00018f77f2f0320c557190d7a144bdd3,1,3,259.83
000229ec398224ef6ca0657da4fc703e,1,5,216.87
00024acbcdf0a6daa1e931b038114c75,1,2,25.78
00042b26cf59d7ce69dfabb4e55b4fd9,1,3,218.04
...,...,...,...
fffc94f6ce00a00581880bf54a75a037,1,1,343.40
fffcd46ef2263f404302a634eb57f7eb,1,1,386.53
fffce4705a9662cd70adb13d4a31832d,1,3,116.85
fffe18544ffabc95dfada21779c9644f,1,3,64.71
fffe41c64501cc87c801fd61db3f6244,1,1,55.79

# jointure paiements et commandes

> >  - jointure en 'how = 'left'' retourne tous les enregistrements de la table de gauche même si la condition n’est pas vérifié dans l’autre table.
 - jointure en 'how = 'right'' retourne tous les enregistrements de la table de droite même si la condition n’est pas vérifié dans l’autre table. <br> <center><font color='red'>Attention à la taille de la table !

In [46]:
dfpmt.merge (dfcmd, on = 'order_id', how='right').shape
#dfpmt.merge (dfcmd, on = 'order_id', how='left')

(103887, 12)

In [44]:
dfpmt.shape

(103886, 5)

> La fonction '.nunique()' renvoie le nombre d'éléments uniques dans l'objet

In [48]:
dfpmt.order_id.nunique(), dfcmd.order_id.nunique()

(99440, 99441)

In [73]:
dfpmt.columns

Index(['order_id', 'payment_sequential', 'payment_type',
       'payment_installments', 'payment_value'],
      dtype='object')

In [74]:
dfpmt['CB']=dfpmt.payment_installments*dfpmt.payment_value

> Agrégat .agg({'CB':'sum'}).reset_index()

In [75]:
df1 = dfpmt.groupby('order_id').agg({'CB':'sum'}).reset_index()
df1

                               order_id       CB
0      00010242fe8c5a6d1ba2dd792cb16214   144.38
1      00018f77f2f0320c557190d7a144bdd3   779.49
2      000229ec398224ef6ca0657da4fc703e  1084.35
3      00024acbcdf0a6daa1e931b038114c75    51.56
4      00042b26cf59d7ce69dfabb4e55b4fd9   654.12
...                                 ...      ...
99435  fffc94f6ce00a00581880bf54a75a037   343.40
99436  fffcd46ef2263f404302a634eb57f7eb   386.53
99437  fffce4705a9662cd70adb13d4a31832d   350.55
99438  fffe18544ffabc95dfada21779c9644f   194.13
99439  fffe41c64501cc87c801fd61db3f6244    55.79

[99440 rows x 2 columns]

In [76]:
df1.merge (dfcmd, on='order_id', how='right').shape

(99441, 12)

# Jointure entre df1 et df2

In [77]:
df2 = dfcmd.merge (df1, on='order_id', how='left')
df2

,order_id,customer_id,order_status,order_purchase_timestamp,order_approved_at,order_delivered_carrier_date,order_delivered_customer_date,order_estimated_delivery_date,annee,mois,jours,CB
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017-10-02 10:56:33,2017-10-02 11:07:15,2017-10-04 19:55:00,2017-10-10 21:25:13,2017-10-18,2017,10,0,38.71
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018-07-24 20:41:37,2018-07-26 03:24:27,2018-07-26 14:31:00,2018-08-07 15:27:45,2018-08-13,2018,7,1,141.46
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018-08-08 08:38:49,2018-08-08 08:55:23,2018-08-08 13:50:00,2018-08-17 18:06:29,2018-09-04,2018,8,2,537.36
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017-11-18 19:28:06,2017-11-18 19:45:59,2017-11-22 13:39:59,2017-12-02 00:28:42,2017-12-15,2017,11,5,72.20
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018-02-13 21:18:39,2018-02-13 22:20:29,2018-02-14 19:46:34,2018-02-16 18:17:02,2018-02-26,2018,2,1,28.62
...,...,...,...,...,...,...,...,...,...,...,...,...
99436,9c5dedf39a927c1b2549525ed64a053c,39bd1228ee8140590ac3aca26f2dfe00,delivered,2017-03-09 09:54:05,2017-03-09 09:54:05,2017-03-10 11:18:03,2017-03-17 15:08:01,2017-03-28,2017,3,3,255.24
99437,63943bddc261676b46f01ca7ac2f7bd8,1fca14ff2861355f6e5f14306ff977a7,delivered,2018-02-06 12:58:58,2018-02-06 13:10:37,2018-02-07 23:22:42,2018-02-28 17:37:56,2018-03-02,2018,2,1,585.00
99438,83c1379a015df1e13d02aae0204711ab,1aa71eb042121263aafbe80c1b562c9c,delivered,2017-08-27 14:46:43,2017-08-27 15:04:16,2017-08-28 20:52:26,2017-09-21 11:24:17,2017-09-27,2017,8,6,1355.05
99439,11c177c8e97725db2631073c19f07b62,b331b74b18dc79bcdf6532d51e1637c1,delivered,2018-01-08 21:28:27,2018-01-08 21:36:21,2018-01-12 15:35:03,2018-01-25 23:32:54,2018-02-15,2018,1,0,1764.64
99440,66dea50a8b16d9b4dee7af250b4be1a5,edb027a75a1449115f6b43211ae02a24,delivered,2018-03-08 20:57:30,2018-03-09 11:20:28,2018-03-09 22:11:59,2018-03-16 13:08:30,2018-04-03,2018,3,3,86.86

In [79]:
df2.columns

Index(['order_id', 'customer_id', 'order_status', 'order_purchase_timestamp',
       'order_approved_at', 'order_delivered_carrier_date',
       'order_delivered_customer_date', 'order_estimated_delivery_date',
       'annee', 'mois', 'jours', 'CB'],
      dtype='object')

> On retire les colones qui ne nous intéressent pas avec la fonction 'drop'

In [80]:
df2.drop(columns = ['order_purchase_timestamp',
       'order_approved_at', 'order_delivered_carrier_date',
       'order_delivered_customer_date', 'order_estimated_delivery_date'],inplace=True)

In [81]:
df2.head()

,order_id,customer_id,order_status,annee,mois,jours,CB
0,e481f51cbdc54678b7cc49136f2d6af7,9ef432eb6251297304e76186b10a928d,delivered,2017,10,0,38.71
1,53cdb2fc8bc7dce0b6741e2150273451,b0830fb4747a6c6d20dea0b8c802d7ef,delivered,2018,7,1,141.46
2,47770eb9100c2d0c44946d9cf07ec65d,41ce2a54c0b03bf3443c3d931a367089,delivered,2018,8,2,537.36
3,949d5b44dbf5de918fe9c16f97b45f8a,f88197465ea7920adcdbec7375364d82,delivered,2017,11,5,72.20
4,ad21c59c0840e6cb83a9ceb5573f8159,8ab97904e6daea8866dbdbc4fb7aad2c,delivered,2018,2,1,28.62

> On modifie les valeurs des id

In [82]:
df2.sort_values('order_id').order_id.unique()

array(['00010242fe8c5a6d1ba2dd792cb16214',
       '00018f77f2f0320c557190d7a144bdd3',
       '000229ec398224ef6ca0657da4fc703e', ...,
       'fffce4705a9662cd70adb13d4a31832d',
       'fffe18544ffabc95dfada21779c9644f',
       'fffe41c64501cc87c801fd61db3f6244'], dtype=object)

> Création de dictionnaires pour renommer les différents id

In [84]:
dic_order_id = {id:i for i,id in enumerate(df2.sort_values('order_id').order_id.unique())}
dic_order_id_reverse = {i:id for i,id in enumerate(df2.sort_values('order_id').order_id.unique())}

In [85]:
dic_customer_id = {id:i for i,id in enumerate(df2.sort_values('customer_id').customer_id.unique())}
dic_customer_id_reverse = {i:id for i,id in enumerate(df2.sort_values('customer_id').customer_id.unique())}

>  - 'apply' permet d'appliquer une fonction sur chaque ligne de ma table
 - On utilise l'expression 'lambda' afin d'appeller la fonction

In [88]:
df2['customer_id'].apply(lambda x:dic_customer_id[x])

0        61760
1        68729
2        25513
3        96583
4        53773
         ...
99436    22434
99437    12334
99438    10364
99439    69789
99440    92466
Name: customer_id, Length: 99441, dtype: int64

In [91]:
def f1 (x):
    return dic_customer_id[x]

In [92]:
df2['customer_id'].apply(f1)

0        61760
1        68729
2        25513
3        96583
4        53773
         ...
99436    22434
99437    12334
99438    10364
99439    69789
99440    92466
Name: customer_id, Length: 99441, dtype: int64

In [94]:
df2['customer_id'] = df2['customer_id'].apply(lambda x:dic_customer_id[x])

In [95]:
df2.head()

,order_id,customer_id,order_status,annee,mois,jours,CB
0,e481f51cbdc54678b7cc49136f2d6af7,61760,delivered,2017,10,0,38.71
1,53cdb2fc8bc7dce0b6741e2150273451,68729,delivered,2018,7,1,141.46
2,47770eb9100c2d0c44946d9cf07ec65d,25513,delivered,2018,8,2,537.36
3,949d5b44dbf5de918fe9c16f97b45f8a,96583,delivered,2017,11,5,72.20
4,ad21c59c0840e6cb83a9ceb5573f8159,53773,delivered,2018,2,1,28.62

In [96]:
df2['order_id'].apply(lambda x:dic_order_id[x])

0        88950
1        32545
2        27769
3        57385
4        67043
         ...
99436    60364
99437    38641
99438    51044
99439     6960
99440    39933
Name: order_id, Length: 99441, dtype: int64

In [97]:
df2['order_id'] = df2['order_id'].apply(lambda x:dic_order_id[x])

In [98]:
df2.head()

   order_id  customer_id order_status  annee  mois  jours      CB
0     88950        61760    delivered   2017    10      0   38.71
1     32545        68729    delivered   2018     7      1  141.46
2     27769        25513    delivered   2018     8      2  537.36
3     57385        96583    delivered   2017    11      5   72.20
4     67043        53773    delivered   2018     2      1   28.62

# Enregistrement de la table

In [100]:
import sqlalchemy
engine = sqlalchemy.create_engine("oracle+cx_oracle://stagbi07:Phoenix#Icar67@51.91.76.248:15440/coursdb")
connection = engine.connect()

C:\Users\clara\anaconda3\lib\site-packages\sqlalchemy\dialects\oracle\base.py:1364: SAWarning: Oracle version (18, 3, 0, 0, 0) is known to have a maximum identifier length of 128, rather than the historical default of 30. SQLAlchemy 1.4 will use 128 for this database; please set max_identifier_length=128 in create_engine() in order to test the application with this new length, or set to 30 in order to assure that 30 continues to be used.  In particular, pay close attention to the behavior of database migrations as dynamically generated names may change. See the section 'Max Identifier Lengths' in the SQLAlchemy Oracle dialect documentation for background.
  util.warn(

> Avec 'Replace', on remplace la table qui possède le nom 'commandes'

In [102]:
df2.to_sql('commandes', con=connection,
if_exists='replace',
index=False,
dtype={ "order_id": sqlalchemy.types.Integer(),
"customer_id": sqlalchemy.types.Integer(),
"order_status": sqlalchemy.types.String(80),
"annee": sqlalchemy.types.Integer(),
"mois": sqlalchemy.types.Integer(),
"jours": sqlalchemy.types.Integer(),
"CB": sqlalchemy.types.Float()
 })

> On appel la table avec 'query'

In [103]:
query = """select * from commandes"""
df = pd.read_sql_query(query, connection)
df

       order_id  customer_id order_status  annee  mois  jours       cb
0         97317         2466    delivered   2017    12      5   291.16
1         46291        35688    delivered   2018     5      2   137.74
2         20925        21163    delivered   2018     1      3  1006.44
3         30060        34544    delivered   2018     3      3   132.57
4         52344         2761    delivered   2017    11      3   161.46
...         ...          ...          ...    ...   ...    ...      ...
99436     10321        10116    delivered   2017     7      0   486.45
99437     55304        44206     invoiced   2017     1      4   543.00
99438      1486        96854    delivered   2018     6      0   404.22
99439     34623        63213    delivered   2018     8      2   589.65
99440     85078        48411    delivered   2017     2      6   176.39

[99441 rows x 7 columns]